#====================================
# installer for Mac
# how to run
# brew tap Homebrew/brewdler
# $ brew brewdle
#====================================
tap 'caskroom/cask'
tap 'homebrew/brewdler'
tap 'homebrew/python'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'phinze/cask'
tap 'sanemat/font'
brew 'autoconf'
brew 'automake'
brew 'boost'
brew 'brew-cask'
brew 'cairo'
brew 'calc'
brew 'clisp'
brew 'cloog'
brew 'cmake'
brew 'cmigemo', args: ['HEAD']
brew 'czmq'
brew 'dfu-programmer'
brew 'eigen'
brew 'emacs'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'gcc'
brew 'gdbm'
brew 'gettext'
brew 'glib'
brew 'gmp'
brew 'gobject-introspection'
brew 'graphviz'
brew 'harfbuzz'
brew 'hub'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'isl'
brew 'jpeg'
brew 'libffi'
brew 'libmpc'
brew 'libpng'
brew 'libsigsegv'
brew 'libtiff'
brew 'libtool'
brew 'libusb'
brew 'libusb-compat'
brew 'llvm'
brew 'llvm35', args: ['without-assertions']
brew 'mpfr'
brew 'nkf'
brew 'nmap'
brew 'numpy'
brew 'opencv'
brew 'openexr'
brew 'openssl'
brew 'pango'
brew 'pcre'
brew 'pixman'
brew 'pkg-config'
brew 'python'
brew 'python3'
brew 'readline'
brew 'ricty', args: ['vim-powerline']
brew 'sqlite'
brew 'the_silver_searcher'
brew 'xz'
brew 'zeromq'
brew 'zsh'
cask 'arduino'
cask 'bettertouchtool'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'iterm2'
cask 'karabiner'
cask 'skype'
cask 'vlc'
cask 'xquartz'
