oh-my-fish/theme-agnoster
oh-my-fish/plugin-emacs
oh-my-fish/plugin-peco
edc/bass
oh-my-fish/plugin-extract
jethrokuan/z
iory/ros-tools
iory/compress
